# Задача 1. Напишите программу,
# которая выводит нечетные числа из заданного списка
# и останавливается, если встречает число 554.

# lst =[1, 651, 4, 9, 554, 7]
#
# import random                               # случайный список
#
# lst=[554]
#
# for i in range (random.randint(10, 15)):   #сколько чисел в списке
#     x = random.randint(100,600)           # какие числа в списке
#     lst.append(x)
#
# print (lst)
# random.shuffle(lst)                        #перемешивание элементов в списке
# print (lst)
#
# for i in lst:
#     if i % 2 != 0:                          # проверка на четность
#         print (i, end='  ')                 # выводит в одну строку
#     if i == 554:
#         break

# Задача 2. Сложить числа вещественного числа
#
# number = '5.679'
# sum = 0
# for i in number:
#     if i != '.':
#         sum +=int(i)  # преобразовали строку в целое число и суммируем
# print (sum)

# Задача 3. Посчитайте, сколько раз символ встречается в строке

# str = 'Посчитайте, сколько раз символ встречается в строке'
# sim = 'в'
# count = 0
# for i in str:
#     if i == sim:
#         count += 1
# print(count)
